<template>
  <div id="signup">
    <!-- Page Header Start -->
    <CommonHeader :title="pageInfo.title" :category="pageInfo.category" :menu="pageInfo.menu" ref="header"/>
    <!-- Page Header End -->

    <div class="container">
      <div class="row">
        <div class="col col-md-12">
          <n-checkbox style="margin: 25px 0px 25px 0px;" size="large" v-model:checked="agreeAll" @update:checked="checkAll"><span class="agree-text">이용약관과 개인정보처리방침에 모두 동의합니다.</span></n-checkbox>
        </div>
        <div class="col col-md-12" style="margin-bottom: 25px;">
          <n-card title="이용약관">
            <n-scrollbar style="max-height: 300px">
              <strong>[제1장 총 칙]</strong>
              <br><strong>제1조(목적)</strong>
              <br>이 약관은 국제원(이하 "홈페이지"이라 한다)에서 제공하는 이메일 및 홈페이지구축서비스(이하 "서비스"라 한다)의 이용조건 및 절차에 관한 사항을 규정함을 목적으로 합니다.
              <br>
              <br><strong>제2조(정의)</strong>
              <br>이 약관에서 사용하는 용어의 정의는 다음 각호와 같습니다.
              <br>1. 회원 : 이용자 아이디를 부여받은 자
              <br>2. ID : 홈페이지가 승인하는 문자 또는 숫자의 조합
<!--              <br>3. 비밀번호 : 비밀 보호를 위해 회원 자신이 설정한 문자, 숫자의 조합-->
              <br>
              <br><strong>제3조(효력의 발생과 변경)</strong>
              <br>① 이 약관의 내용은 홈페이지 홈페이지 화면에 게시하거나 기타의 방법으로 공지함으로써 효력이 발생됩니다.
              <br>② 홈페이지은 이 약관을 변경할 수 있으며, 변경된 약관은 이용자에게 공지함으로써 효력이 발생됩니다.
              <br>
              <br><strong>제4조(준용규정)</strong>
              <br>이 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법 및 기타 관련법령의 규정에 따릅니다.
              <br>
              <br><strong>[제2장 서비스 이용계약제5조(이용계약의 성립)]</strong>
              <br>이용계약은 이용자의 이용신청에 대한 홈페이지의 승낙과 이용자의 약관 내용에 대한 동의로 성립됩니다.
              <br>
              <br><strong>제6조(이용신청)</strong>
              <br>이용신청은 인터넷을 통하여 이용자가 홈페이지에서 정한 가입신청서에 기록하여 신청할 수 있습니다.
              <br>
              <br><strong>제7조(이용신청의 승낙)</strong>
              <br>① 회원이 신청서의 모든 사항을 정확히 기재하여 이용신청을 하였을 경우에 승낙합니다.
              <br>② 다음 각호의 1에 해당하는 경우에는 이용 승낙을 하지 않을 수 있습니다.
              <br>1. 현재 거주지가 구청이 아닌 경우
              <br>2. 홈페이지의 관할구역내에 사무소를 두지 않은 기업체·법인 및 단체인 경우
              <br>3. 이용신청의 내용을 허위로 기재한 경우
              <br>4. 다른 사람의 명의를 사용하여 신청한 경우
              <br>5. 기타 이용신청 요건에 미비되었을 때
              <br>
              <br><strong>제8조(계약사항의 변경)</strong>
              <br>회원은 이용신청시 기재한 사항이 변경되었을 경우에는 인터넷을 통하여 수정 요청을 할 수 있습니다.
              <br>
              <br><strong>[제3장 계약당사자의 의무]</strong>
              <br><strong>제9조(홈페이지의 의무)</strong>
              <br>홈페이지은 서비스 제공과 관련해서 알고 있는 회원의 신상 정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습니다.
              <br>단, 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 또는 기타 관계법령에서 정한 절차에 의한 요청이 있을 경우에는 그러하지 않습니다.
              <br>
              <br><strong>제10조(회원의 의무)</strong>
              <br>① 회원은 서비스를 이용할 때 다음 각호의 행위를 하지 않아야 합니다.
              <br>1. 다른 회원의 ID를 부정하게 사용하는 행위
              <br>2. 서비스에서 얻은 정보를 복제, 출판 또는 제3자에게 제공하는 행위
              <br>3. 홈페이지의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 행위
              <br>4. 공공질서 및 미풍양속에 위반되는 내용을 유포하는 행위
              <br>5. 범죄와 결부된다고 객관적으로 판단되는 행위
              <br>6. 기타 관계법령에 위반되는 행위
              <br>② 회원은 서비스를 이용하여 영업활동을 할 수 없으며, 영업활동에 이용하여 발생한 결과에 대하여 홈페이지은 책임을 지지 않습니다.
              <br>③ 회원은 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도·증여할 수 없으며, 이를 담보로도 제공할 수 없습니다.
              <br>
              <br><strong>[제4장 서비스 이용제11조(회원 홈페이지에 관한 의무)]</strong>
              <br>① 회원은 필요에 따라 자신의 홈페이지, 게시판, 방명록, 등록자료 유지보수에 대한 관리책임을 갖습니다.
              <br>② 회원은 홈페이지에서 제공하는 자료를 임의로 삭제, 변경할 수 없습니다.
              <br>③ 회원은 자신의 홈페이지에 공공질서 및 미풍양속에 위반되는 내용물이나 제3자의 저작권 등 기타권리를 침해하는 내용물을 등록하는 행위를 하지 않아야 합니다. 만약 이와같은 내용물을 게재하였을때 발생하는 결과에 대한 모든 책임은 회원에게 있습니다.
              <br>④ 회원은 자신의 책임하에 개설한 홈페이지를 백업 등 여러가지 방법으로 본인이 관리하여야 합니다.
              <br>
              <br><strong>제12조(회원의 게시물 관리 및 삭제)</strong>
              <br>① 효율적인 서비스 운영을 위하여 회원의 메모리 공간, 메시지크기, 보관일수 등을 제한할 수 있으며 등록하는 내용이 다음 각 호의 1에 해당하는 경우에는 사전 통지없이 삭제할 수 있습니다.
              <br>1. 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를 손상시키는 내용인 경우
              <br>2. 공공질서 및 미풍양속에 위반되는 내용인 경우
              <br>3. 범죄적 행위에 결부된다고 인정되는 내용인 경우
              <br>4. 홈페이지의 저작권, 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
              <br>5. 회원이 자신의 홈페이지와 게시판에 음란물을 게재하거나 음란 사이트를 링크하는 경우
              <br>6. 기타 관계법령에 위반된다고 판단되는 경우
              <br>
              <br><strong>제13조(게시물의 저작권)</strong>
              <br>게시물의 저작권은 게시자 본인에게 있으며 회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에 게재된 자료를 상업적으로 사용할 수 없습니다.
              <br>
              <br><strong>제14조(서비스 이용시간)</strong>
              <br>서비스의 이용은 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간을 원칙으로 합니다. 다만 정기 점검 등의 사유 발생시는 그러하지 않습니다.
              <br>
              <br><strong>제15조(서비스 이용 책임)</strong>
              <br>서비스를 이용하여 해킹, 음란사이트 링크, 상용S/W 불법배포 등의 행위를 하여서는 아니되며 이를 위반으로 인해 발생한 영업활동의 결과 및 손실, 관계기관에 의한 법적 조치 등에 관하여는 구청은 책임을 지지 않습니다.
              <br>
              <br><strong>제16조(서비스 제공의 중지)</strong>
              <br>다음 각호의 1에 해당하는 경우에는 서비스 제공을 중지할 수 있습니다.
              <br>1. 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
              <br>2. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을 경우
              <br>3. 시스템 점검이 필요한 경우
              <br>4. 기타 불가항력적 사유가 있는 경우
              <br>
              <br><strong>[제5장 계약해지 및 이용제한제17조(계약해지 및 이용제한)]</strong>
              <br>① 회원이 이용계약을 해지하고자 하는 때에는 회원 본인이 인터넷을 통하여 해지신청을 하여야 하며, 홈페이지에서는 본인 여부를 확인 후 조치합니다.
              <br>② 홈페이지은 회원이 다음 각호의 1에 해당하는 행위를 하였을 경우 사전 통지없이 이용계약을 해지하거나 또는 서비스 이용을 중지할 수 있습니다.
              <br>1. 타인의 이용자ID 및 비밀번호를 도용한 경우
              <br>2. 서비스 운영을 고의로 방해한 경우
              <br>3. 허위로 가입 신청을 한 경우
              <br>4. 같은 사용자가 다른 ID로 이중 등록을 한 경우
              <br>5. 공공질서 및 미풍양속에 저해되는 내용을 유포시킨 경우
              <br>6. 타인의 명예를 손상시키거나 불이익을 주는 행위를 한 경우
              <br>7. 서비스의 안정적 운영을 방해할 목적으로 다량의 정보를 전송하거나 광고성 정보를 전송하는 경우
              <br>8. 정보통신설비의 오작동이나 정보 등의 파괴를 유발시키는 컴퓨터바이러스 프로그램 등을 유포하는 경우
              <br>9. 홈페이지 또는 다른 회원이나 제3자의 지적재산권을 침해하는 경우
              <br>10. 타인의 개인정보, 이용자ID 및 비밀번호를 부정하게 사용하는 경우
              <br>11. 회원이 자신의 홈페이지나 게시판 등에 음란물을 게재하거나 음란 사이트를 링크하는 경우
              <br>12. 기타 관련법령에 위반된다고 판단되는 경우
              <br>
              <br><strong>[제6장 면 책제18조(면책 조항)]</strong>
              <br>① 홈페이지은 회원이 서비스를 이용하여 얻은 정보 및 자료 등에 대하여 책임을 지지 않습니다.
              <br>② 홈페이지은 회원이 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 기타 어떠한 내용에 관하여서도 책임을 지지 않습니다.
              <br>
              <br><strong>제19조(재판 관할)</strong>
              <br>서비스 이용으로 발생한 분쟁에 대해 소송이 제기 될 경우 홈페이지은 본청 소재지를 관할하는 법원을 전속 관할법원으로 합니다.
              <br>
              <br><strong>[부 칙]</strong>
              <br>이 약관은 2023년 1월 1일부터 시행합니다.
            </n-scrollbar>
              <n-checkbox style="margin: 25px 0px 0px 0px;" size="large" v-model:checked="agree1" @update:checked="checkOne"><span class="agree-text">이용 약관에 동의합니다.</span> <span class="agree-text" style="color: red;">(필수)</span></n-checkbox>
          </n-card>
        </div>
        <div class="col col-md-12">
          <n-card title="개인정보처리방침">
            <n-scrollbar style="max-height: 300px">
              <br>＜세진철망주식회사＞('http://sjwire.co.kr/'이하 '세진건업(주)')은(는) 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.
              <br>
              <br>○ 이 개인정보처리방침은 2023년 1월 1부터 적용됩니다.
              <br>
              <br><strong>제1조(개인정보의 처리 목적)</strong>
              <br>＜세진철망주식회사＞('http://sjwire.co.kr/'이하 '세진건업(주)')은(는) 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.
              <br>1. 홈페이지 회원가입 및 관리
              <br>회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리 목적으로 개인정보를 처리합니다.
              <br>2. 재화 또는 서비스 제공
              <br>물품배송, 서비스 제공, 계약서·청구서 발송, 맞춤서비스 제공, 본인인증을 목적으로 개인정보를 처리합니다.
              <br>3. 마케팅 및 광고에의 활용
              <br>접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.
              <br>
              <br><strong>제2조(개인정보의 처리 및 보유 기간)</strong>
              <br>① ＜세진철망주식회사＞은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.
              <br>② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
              <br>1.＜홈페이지 회원가입 및 관리＞
              <br>＜홈페이지 회원가입 및 관리＞와 관련한 개인정보는 수집.이용에 관한 동의일로부터＜준영구＞까지 위 이용목적을 위하여 보유.이용됩니다.
              <br>보유근거 : 고객 관리 및 서비스 제공에 참고자료
              <br>
              <br><strong>제3조(처리하는 개인정보의 항목)</strong>
              <br>① ＜세진철망주식회사＞은(는) 다음의 개인정보 항목을 처리하고 있습니다.
              <br>1＜재화 또는 서비스 제공＞
              <br>필수항목 : 휴대전화번호, 이름, 회사명, 서비스 이용 기록
              <br>선택항목 : 이메일
              <br>
              <br><strong>제4조(개인정보의 제3자 제공에 관한 사항)</strong>
              <br>① ＜세진철망주식회사＞은(는) 개인정보를 제1조(개인정보의 처리 목적)에서 명시한 범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등 「개인정보 보호법」 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.
              <br>② ＜세진철망주식회사＞은(는) 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
              <br>1. ＜세진철망주식회사＞
              <br>개인정보를 제공받는 자 : 세진철망주식회사
              <br>제공받는 자의 개인정보 이용목적 : 이메일, 휴대전화번호, 로그인ID, 이름, 회사명, 서비스 이용 기록, 접속 IP 정보
              <br>제공받는 자의 보유.이용기간: 준영구
              <br>
              <br><strong>제5조(개인정보처리의 위탁에 관한 사항)</strong>
              <br>① ＜세진철망주식회사＞은(는) 개인정보 처리업무를 위탁하고 있지 않습니다.
              <br>
              <br><strong>제6조(개인정보의 파기절차 및 파기방법)</strong>
              <br>① ＜세진철망주식회사＞ 은(는) 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.
              <br>② 정보주체로부터 동의받은 개인정보 보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에 따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의 데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다.
              <br>③ 개인정보 파기의 절차 및 방법은 다음과 같습니다.
              <br>1. 파기절차
              <br>＜세진철망주식회사＞ 은(는) 파기 사유가 발생한 개인정보를 선정하고, ＜세진철망주식회사＞ 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
              <br>2. 파기방법
              <br>전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다
              <br>
              <br><strong>제7조(정보주체와 법정대리인의 권리·의무 및 그 행사방법에 관한 사항)</strong>
              <br>① 정보주체는 세진철망주식회사에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.
              <br>② 제1항에 따른 권리 행사는세진철망주식회사에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 세진철망주식회사은(는) 이에 대해 지체 없이 조치하겠습니다.
              <br>③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
              <br>④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.
              <br>⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
              <br>⑥ 세진철망주식회사은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.
              <br>
              <br><strong>제8조(개인정보의 안전성 확보조치에 관한 사항)</strong>
              <br>＜세진철망주식회사＞은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
              <br>1. 정기적인 자체 감사 실시
              <br>개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.
              <br>2. 해킹 등에 대비한 기술적 대책
              <br>＜세진철망주식회사＞('세진건업(주)')은 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.
              <br>3. 개인정보의 암호화
              <br>이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.
              <br>4. 개인정보에 대한 접근 제한
              <br>개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
              <br>5. 비인가자에 대한 출입 통제
              <br>개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해 출입통제 절차를 수립, 운영하고 있습니다.
              <br>
              <br><strong>제9조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그 거부에 관한 사항)</strong>
              <br>① 세진철망주식회사 은(는) 이용자에게 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용합니다.
              <br>② 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.
              <br>가. 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.
              <br>나. 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다.
              <br>다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.
              <br>
              <br><strong>제10조(행태정보의 수집·이용·제공 및 거부 등에 관한 사항)</strong>
              <br>행태정보의 수집·이용·제공 및 거부등에 관한 사항
              <br>＜세진철망주식회사＞은(는) 온라인 맞춤형 광고 등을 위한 행태정보를 수집·이용·제공하지 않습니다.
              <br>
              <br><strong>제11조(추가적인 이용·제공 판단기준)</strong>
              <br>＜세진철망주식회사＞ 은(는) ｢개인정보 보호법｣ 제15조제3항 및 제17조제4항에 따라 ｢개인정보 보호법 시행령｣ 제14조의2에 따른 사항을 고려하여 정보주체의 동의 없이 개인정보를 추가적으로 이용·제공할 수 있습니다.
              <br>이에 따라 ＜세진철망주식회사＞ 가(이) 정보주체의 동의 없이 추가적인 이용·제공을 하기 위해서 다음과 같은 사항을 고려하였습니다.
              <br>▶ 개인정보를 추가적으로 이용·제공하려는 목적이 당초 수집 목적과 관련성이 있는지 여부
              <br>▶ 개인정보를 수집한 정황 또는 처리 관행에 비추어 볼 때 추가적인 이용·제공에 대한 예측 가능성이 있는지 여부
              <br>▶ 개인정보의 추가적인 이용·제공이 정보주체의 이익을 부당하게 침해하는지 여부
              <br>▶ 가명처리 또는 암호화 등 안전성 확보에 필요한 조치를 하였는지 여부
              <br>※ 추가적인 이용·제공 시 고려사항에 대한 판단기준은 사업자/단체 스스로 자율적으로 판단하여 작성·공개함
              <br>
              <br><strong>제12조(가명정보를 처리하는 경우 가명정보 처리에 관한 사항)</strong>
              <br>＜세진철망주식회사＞ 은(는) 다음과 같은 목적으로 가명정보를 처리하고 있습니다.
              <br>▶ 가명정보의 처리 목적
              <br>- 직접작성 가능합니다.
              <br>▶ 가명정보의 처리 및 보유기간
              <br>- 직접작성 가능합니다.
              <br>▶ 가명정보의 제3자 제공에 관한 사항(해당되는 경우에만 작성)
              <br>- 직접작성 가능합니다.
              <br>▶ 가명정보 처리의 위탁에 관한 사항(해당되는 경우에만 작성)
              <br>- 직접작성 가능합니다.
              <br>▶ 가명처리하는 개인정보의 항목
              <br>- 직접작성 가능합니다.
              <br>▶ 법 제28조의4(가명정보에 대한 안전조치 의무 등)에 따른 가명정보의 안전성 확보조치에 관한 사항
              <br>- 직접작성 가능합니다.
              <br>
              <br><strong>제13조 (개인정보 보호책임자에 관한 사항)</strong>
              <br>① 세진철망주식회사 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
              <br>▶ 개인정보 보호책임자
              <br>성명 : 전흥순
              <br>직책 : 대표이사
              <br>직급 : 대표이사
              <br>연락처 : 031) 352-7086, godoing1000@naver.com , 031) 352-7430
              <br>② 정보주체께서는 세진철망주식회사 의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 세진철망주식회사 은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.
              <br>
              <br><strong>제14조(국내대리인의 지정)</strong>
              <br>정보주체는 ｢개인정보 보호법｣ 제39조의11에 따라 지정된 ＜세진철망주식회사＞의 국내대리인에게 개인정보 관련 고충처리 등의 업무를 위하여 연락을 취할 수 있습니다. ＜세진철망주식회사＞은(는) 정보주체의 개인정보 관련 고충처리 등 개인정보 보호책임자의 업무 등을 신속하게 처리할 수 있도록 노력하겠습니다.
              <br>
              <br><strong>제15조(개인정보의 열람청구를 접수·처리하는 부서)</strong>
              <br>정보주체는 ｢개인정보 보호법｣ 제35조에 따른 개인정보의 열람 청구를 아래의 부서에 할 수 있습니다.
              <br>＜세진철망주식회사＞은(는) 정보주체의 개인정보 열람청구가 신속하게 처리되도록 노력하겠습니다.
              <br>▶ 개인정보 열람청구 접수·처리 부서
              <br>부서명 : 총무팀
              <br>담당자 : 총무팀
              <br>연락처 : 031) 352-7086, 031) 352-7430
              <br>
              <br><strong>제16조(정보주체의 권익침해에 대한 구제방법)</strong>
              <br>정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
              <br>1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
              <br>2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
              <br>3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr)
              <br>4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr)
              <br>「개인정보보호법」제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.
              <br>※ 행정심판에 대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.
            </n-scrollbar>
            <n-checkbox style="margin: 25px 0px 0px 0px;" size="large" v-model:checked="agree2" @update:checked="checkOne"><span class="agree-text">개인정보처리방침에 동의합니다.</span> <span class="agree-text" style="color: red;">(필수)</span></n-checkbox>
          </n-card>
        </div>
        <div class="col col-md-12 text-center" style="margin-top: 25px;">
          <button type="button" class="btn btn-lg btn-light back-button" @click="goSignin">
            <span style="font-size: 0.85em;"><i class="fa fa-chevron-left"/>&nbsp;&nbsp;뒤로가기</span>
          </button>
          <button type="button" class="btn btn-lg login-button" @click="signup">
            <span style="font-size: 0.85em;"><i class="fa fa-comment"/>&nbsp;&nbsp;카카오계정으로 회원가입</span>
          </button>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import CommonHeader from "@/views/common/CommonHeader.vue";
import { defineComponent, ref } from "vue";
import {kakaoSignup, logout} from "../api/auth.js";
import { Comment, Edit, ChevronLeft } from "@vicons/fa";
import { useRoute } from "vue-router";
import { useMessage } from "naive-ui";
import router from "@/routes/index.js";

const pageInfo = {
  title: 'Sign up',
  category: '카카오톡 계정으로 편리하게 회원가입하세요.',
};

const userInfo = ref({
  user_id: '',
  password: '',
});

export default defineComponent({
  created() {
    logout();
  },
  components:{
    CommonHeader,
    Comment,
    Edit,
    ChevronLeft,
  },
  setup() {
    const route = useRoute();
    const message = useMessage();
    const agreeAll = ref(false);
    const agree1 = ref(false);
    const agree2 = ref(false);
    const signup= ()=>{
      if(agree1.value && agree2.value){
        kakaoSignup(route);
      }else{
        message.create(
            "이용약관, 개인정보처리방침에 동의 후 회원가입이 가능합니다.",
            {duration: 4000, type: "info"}
        );
      }
    }
    const goSignup= ()=>{
    }
    const goSignin= ()=>{
      router.push('/login');
    }
    const checkAll=(value)=>{
      agree1.value=value;
      agree2.value=value;
    }
    const checkOne=()=>{
      if(agree1.value && agree2.value){
        agreeAll.value=true;
      }else{
        agreeAll.value=false;
      }
    }
    return {
      userInfo,
      pageInfo,
      agreeAll,
      agree1,
      agree2,
      signup,
      goSignup,
      goSignin,
      checkAll,
      checkOne,
    }
  }
});

</script>

<style>
.login-button{
  background-color:#fee500!important;
  border: 5px solid #fee500!important;;
  color: #181600!important;;
}
.login-button:hover{
  background-color: #e0cd24!important;;
  border: 5px solid #e0cd24!important;;
  color: #181600!important;;
}
.signup-button{
  min-width: 230px;
  height:56px;
}
.back-button{
  height:56px;
  margin-right:5px;
}
.login-or {
  position: relative;
  color: #aaa;
  margin-top: 10px;
  margin-bottom: 10px;
  padding-top: 10px;
  padding-bottom: 10px;
}
.span-or {
  display: block;
  position: absolute;
  left: 50%;
  top: -2px;
  margin-left: -25px;
  background-color: #fff;
  width: 50px;
  text-align: center;
}
.hr-or {
  height: 1px;
  margin-top: 0px !important;
  margin-bottom: 0px !important;
}
div.n-card-header__main{
  font-weight: bold!important;
  font-size: 1.3em!important;
}
span.agree-text{
  font-size: 1.15em;
}
</style>